#### Terraform Validation & Plan Results
* Terraform Version 📎`1.14.4`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hYzA5N2FkYS0yOTQyLTQwMjItYTEzNy1lN2JhYmQ3N2I4Yzc7b2JqZWN0SWQ9ZjgxYjViOTYtZjEwZS00NjdkLWJhMGMtNDE5NmZkMWEzMWY4O3N1YnNjcmlwdGlvbklkPWU4MmM1MjY3LTlkYzQtNGY0NS1hYzEzLWFiZGQ1ZTEzMGQyNzt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_container_app: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_github_pat: Refreshing state... [id=https://ghar-prd-kv001.vault.azure.net/secrets/github-pat/af418f017c584b31a4522b65eae60f9f][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hYzA5N2FkYS0yOTQyLTQwMjItYTEzNy1lN2JhYmQ3N2I4Yzc7b2JqZWN0SWQ9ZjgxYjViOTYtZjEwZS00NjdkLWJhMGMtNDE5NmZkMWEzMWY4O3N1YnNjcmlwdGlvbklkPWU4MmM1MjY3LTlkYzQtNGY0NS1hYzEzLWFiZGQ1ZTEzMGQyNzt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ghar-prd-uai001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.Insights/components/ghar-prd-appi001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mazapi_resource.subnet_container_app: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/ConAppEnvironmentSubnet][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001/providers/Microsoft.Authorization/roleAssignments/d57023f6-9785-298e-a302-37abbe739271][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001/providers/Microsoft.Authorization/roleAssignments/0ccead67-5873-d54b-c77e-c82584e25096][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001/providers/Microsoft.Authorization/roleAssignments/47ed6b6b-edec-179d-cca8-76371fdbf9d6][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001|applicationLogs-0][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/ConAppPrivateEndpointSubnet][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazapi_resource.container_apps_environment: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.App/managedEnvironments/ghar-prd-cae001][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.Network/privateEndpoints/ghar-prd-kv001-vault-pe][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.Insights/components/ghar-prd-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.Insights/components/ghar-prd-appi001|applicationLogs-0][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-26T08:28:50Z][0m
[0m[1mazapi_resource.container_apps_job: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.App/jobs/ghar-prd-caj001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # azapi_resource.container_apps_job[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "container_apps_job" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m configuration       = {
                  [33m~[0m[0m secrets            = [
                      [33m~[0m[0m {
                          [33m~[0m[0m keyVaultUrl = "https://ghar-prd-kv001.vault.azure.net/secrets/github-pat" -> (known after apply)
                          [33m~[0m[0m name        = "personal-access-token" [33m->[0m[0m "app-private-key"
                          [33m~[0m[0m value       = (sensitive value)
                            [90m# (1 unchanged attribute hidden)[0m[0m
                        },
                    ]
                    [90m# (4 unchanged attributes hidden)[0m[0m
                }
              [33m~[0m[0m template            = {
                  [33m~[0m[0m containers     = [
                      [33m~[0m[0m {
                          [33m~[0m[0m env          = [
                                [90m# (2 unchanged elements hidden)[0m[0m
                                {
                                    name  = "RANDOM_RUNNER_SUFFIX"
                                    value = "true"
                                },
                              [33m~[0m[0m {
                                  [33m~[0m[0m name      = "ACCESS_TOKEN" [33m->[0m[0m "APP_ID"
                                  [31m-[0m[0m secretRef = "personal-access-token"
                                  [32m+[0m[0m value     = (sensitive value)
                                },
                              [32m+[0m[0m {
                                  [32m+[0m[0m name      = "APP_PRIVATE_KEY"
                                  [32m+[0m[0m secretRef = "app-private-key"
                                },
                                {
                                    name  = "RUNNER_SCOPE"
                                    value = "org"
                                },
                                [90m# (11 unchanged elements hidden)[0m[0m
                            ]
                            name         = "github-runner"
                          [33m~[0m[0m resources    = {
                              [33m~[0m[0m memory = "3Gi" [33m->[0m[0m "3.0Gi"
                                [90m# (1 unchanged attribute hidden)[0m[0m
                            }
                            [90m# (2 unchanged attributes hidden)[0m[0m
                        },
                    ]
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
                [90m# (2 unchanged attributes hidden)[0m[0m
            }
        }
        id                        = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.App/jobs/ghar-prd-caj001"
        name                      = "ghar-prd-caj001"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.App/jobs/ghar-prd-caj001"
          [31m-[0m[0m identity   = {
              [31m-[0m[0m userAssignedIdentities = {
                  [31m-[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourcegroups/ghar-prd-container-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ghar-prd-uai001" = {
                      [31m-[0m[0m clientId    = "0143d2c1-25f9-41b1-aa93-f12c37a4379d"
                      [31m-[0m[0m principalId = "90402171-7e41-472a-9d8a-900bad422566"
                    }
                }
            }
          [31m-[0m[0m properties = {
              [31m-[0m[0m configuration       = {
                  [31m-[0m[0m eventTriggerConfig = {
                      [31m-[0m[0m scale = {
                          [31m-[0m[0m rules = [
                              [31m-[0m[0m {
                                  [31m-[0m[0m auth     = [
                                      [31m-[0m[0m {},
                                    ]
                                  [31m-[0m[0m metadata = {
                                      [31m-[0m[0m github-runner             = "https://api.github.com"
                                      [31m-[0m[0m owner                     = "PerfectThymeTech"
                                      [31m-[0m[0m runnerScope               = "org"
                                      [31m-[0m[0m targetWorkflowQueueLength = "1"
                                    }
                                },
                            ]
                        }
                    }
                  [31m-[0m[0m secrets            = [
                      [31m-[0m[0m {},
                    ]
                }
              [31m-[0m[0m eventStreamEndpoint = "https://northeurope.azurecontainerapps.dev/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/containerApps/ghar-prd-caj001/eventstream"
              [31m-[0m[0m provisioningState   = "Succeeded"
              [31m-[0m[0m template            = {
                  [31m-[0m[0m containers = [
                      [31m-[0m[0m {
                          [31m-[0m[0m env       = [
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                              [31m-[0m[0m {},
                            ]
                          [31m-[0m[0m resources = {
                              [31m-[0m[0m ephemeralStorage = ""
                            }
                        },
                    ]
                }
            }
          [31m-[0m[0m tags       = {
              [31m-[0m[0m workload = "github-action-runners"
            }
          [31m-[0m[0m type       = "Microsoft.App/jobs"
        } -> (known after apply)
        tags                      = {
            "workload" = "github-action-runners"
        }
        [90m# (8 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_github_app_private_key[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_github_app_private_key" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001"
      [32m+[0m[0m name                    = "github-app-private-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m value_wo                = (write-only attribute)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_github_pat[0m will be [1m[31mdestroyed[0m
  # (because azurerm_key_vault_secret.key_vault_secret_github_pat is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_github_pat" {
      [31m-[0m[0m content_type            = "text/plain" [90m-> null[0m[0m
      [31m-[0m[0m id                      = "https://ghar-prd-kv001.vault.azure.net/secrets/github-pat/af418f017c584b31a4522b65eae60f9f" [90m-> null[0m[0m
      [31m-[0m[0m key_vault_id            = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001" [90m-> null[0m[0m
      [31m-[0m[0m name                    = "github-pat" [90m-> null[0m[0m
      [31m-[0m[0m resource_id             = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001/secrets/github-pat/versions/af418f017c584b31a4522b65eae60f9f" [90m-> null[0m[0m
      [31m-[0m[0m resource_versionless_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghar-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghar-prd-kv001/secrets/github-pat" [90m-> null[0m[0m
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
      [31m-[0m[0m value                   = (sensitive value) [90m-> null[0m[0m
      [31m-[0m[0m value_wo                = (write-only attribute) [90m-> null[0m[0m
      [31m-[0m[0m value_wo_version        = 0 [90m-> null[0m[0m
      [31m-[0m[0m version                 = "b0d736368e1c4f7983f173453dc093b9" [90m-> null[0m[0m
      [31m-[0m[0m versionless_id          = "https://ghar-prd-kv001.vault.azure.net/secrets/github-pat" [90m-> null[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m [0m1 to add, 1 to change, 1 to destroy.
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"],
[33m│[0m [0m  on .terraform/modules/application_insights/modules/applicationinsights/diagnostics.tf line 1, in resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_application_insights":
[33m│[0m [0m   1: resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_application_insights" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0m`metric` has been deprecated in favor of the `enabled_metric` property and
[33m│[0m [0mwill be removed in v5.0 of the AzureRM provider
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>